Revit 2027 API
BuiltInFailures.AssemblyFailures.AssemblyRenameTypeWarn Property
 Edits to these assemblies changed the naming category and name of these assemblies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AssemblyRenameTypeWarn { get; }
Public Shared ReadOnly Property AssemblyRenameTypeWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AssemblyRenameTypeWarn {
	FailureDefinitionId^ get ();
}
static member AssemblyRenameTypeWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace